# IFCParameter Template Get Property Set Applicable Entities Method

Source: https://www.revitapidocs.com/2026/2dda474c-3a64-4361-5b0b-b91d5066ea7b.htm

---

| IFCParameter Template Get Property Set Applicable Entities Method |
| --- |

Gets the list of IFC entities to which the property set is applicable.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<string> GetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	string propertySetName
)
```

```
Public Function GetPropertySetApplicableEntities (
	propertySetupType As PropertySetupType,
	propertySetName As String
) As IList(Of String)
```

```
public:
IList<String^>^ GetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
```

```
member GetPropertySetApplicableEntities :
        propertySetupType : PropertySetupType *
        propertySetName : string -> IList<string>
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

#### Return Value

IList String
The list of IFC entities to which the property set is applicable. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | A property set with the given name is not present in the template. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace